ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_sdfm_regs.xml
	<register id="SDSTATUS" width="16" page="0" offset="0xe" instances="1" instaddr="2" internal="0" description="SD Status Register">
		<bitfield id="HZ1" description="High-level Threshold crossing (Z) flag Ch1" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HZ2" description="High-level Threshold crossing (Z) flag Ch2" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HZ3" description="High-level Threshold crossing (Z) flag Ch3" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HZ4" description="High-level Threshold crossing (Z) flag Ch4" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="SDINTMODE" width="16" page="0" offset="0x10" instances="1" instaddr="2" internal="0" description="SD Interrupt Mode register">
		<bitfield id="SDINTMODESEL" description="CompxH/L events interrupt mode select" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCTLPARM1" width="16" page="0" offset="0x20" instances="1" instaddr="2" internal="0" description="Control Parameter Register for Ch1">
		<bitfield id="MOD" description="Modulator clocking modes" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SDCLKSEL" description="SD1 Clock source select." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SDCLKSYNC" description="Enable Synchronizer on SD clock" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SDDATASYNC" description="Enable Synchronizer on SD data" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SDDFPARM1" width="16" page="0" offset="0x22" instances="1" instaddr="2" internal="0" description="Data Filter Parameter Register for Ch1">
		<bitfield id="DOSR" description="Data Filter Oversample Ratio= DOSR+1" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="FEN" description="Filter Enable " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="AE" description="Ack Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SST" description="Data filter Structure (SincFast/1/2/3)" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SDSYNCEN" description="Data Filter Reset Enable" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="SDDPARM1" width="16" page="0" offset="0x24" instances="1" instaddr="2" internal="0" description="Data Parameter Register for Ch1">
		<bitfield id="DR" description="Data Representation (0/1 = 16/32b 2's complement)" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SH" description="Shift Control (# bits to shift in 16b mode)" begin="15" end="11" width="5" rwaccess="RW"/>
	</register>
	<register id="SDFLT1CMPH1" width="16" page="0" offset="0x26" instances="1" instaddr="2" internal="0" description="High-level Threshold Register for Ch1">
		<bitfield id="HLT" description="High-level threshold for the comparator filter output" begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDFLT1CMPL1" width="16" page="0" offset="0x28" instances="1" instaddr="2" internal="0" description="Low-level Threshold Register for Ch1">
		<bitfield id="LLT" description="Low-level threshold for the comparator filter output" begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDCPARM1" width="16" page="0" offset="0x2a" instances="1" instaddr="2" internal="0" description="Comparator Filter Parameter Register for Ch1">
		<bitfield id="COSR" description="Comparator Oversample Ratio. Actual rate COSR+1" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="EN_CEVT1" description="CEVT1 Interrupt enable." begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EN_CEVT2" description="CEVT2 Interrupt enable." begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CS1_CS0" description="Comparator Filter Structure (SincFast/1/2/3)" begin="8" end="7" width="2" rwaccess="RW"/>
		<bitfield id="MFIE" description="Modulator Failure Interrupt enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="HZEN" description="High level (Z) Threshold crossing output enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CEVT1SEL" description="Comparator Event1 select" begin="12" end="11" width="2" rwaccess="RW"/>
		<bitfield id="CEN" description="Comparator Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CEVT2SEL" description="Comparator Event2 select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="SDDATA1" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="Data Filter Data Register (16 or 32bit) for Ch1">
		<bitfield id="DATA16" description="Lo-order 16b in 32b mode" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DATA32HI" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="SDDATFIFO1" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="Filter Data FIFO Output(32b) for Ch1">
		<bitfield id="DATA16" description="Lo-order 16b in 32b mode" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DATA32HI" description="Hi-order 16b in 32b mode, 16-bit Data in 16b mode" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="SDCDATA1" width="16" page="0" offset="0x34" instances="1" instaddr="2" internal="0" description="Comparator Filter Data Register (16b) for Ch1">
		<bitfield id="DATA16" description="Comparator Data output - 16b only" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="SDFLT1CMPH2" width="16" page="0" offset="0x36" instances="1" instaddr="2" internal="0" description="Second high level threhold  for CH1">
		<bitfield id="HLT2" description="Second High level threshold." begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDFLT1CMPHZ" width="16" page="0" offset="0x38" instances="1" instaddr="2" internal="0" description="High-level (Z) Threshold Register for Ch1">
		<bitfield id="HLTZ" description="High-level threshold (Z) for the comparator filter output" begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDFIFOCTL1" width="16" page="0" offset="0x3a" instances="1" instaddr="2" internal="0" description="FIFO Control Register for Ch1">
		<bitfield id="SDFFIL" description="SDFIFO Interrupt Level" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SDFFST" description="SDFIFO Status" begin="10" end="6" width="5" rwaccess="R"/>
		<bitfield id="FFIEN" description="SDFIFO data ready Interrupt Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FFEN" description="SDFIFO Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="DRINTSEL" description="Data-Ready Interrupt Source Select" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="OVFIEN" description="SDFIFO Overflow interrupt enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDSYNC1" width="16" page="0" offset="0x3c" instances="1" instaddr="2" internal="0" description="SD Filter Sync control for Ch1">
		<bitfield id="SYNCSEL" description="SDSYNC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="WTSYNCEN" description="Wait-for-Sync Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="WTSYNFLG" description="Wait-for-Sync Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="WTSYNCLR" description="Wait-for-Sync Flag Clear " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="FFSYNCCLREN" description="FIFO Clear-on-SDSYNC Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="WTSCLREN" description="WTSYNFLG Clear-on-FIFOINT Enable" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="SDFLT1CMPL2" width="16" page="0" offset="0x3e" instances="1" instaddr="2" internal="0" description="Second low level threhold  for CH1">
		<bitfield id="LLT2" description="Second low-level threshold for the comparator filter output." begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDCTLPARM2" width="16" page="0" offset="0x40" instances="1" instaddr="2" internal="0" description="Control Parameter Register for Ch2">
		<bitfield id="MOD" description="Modulator clocking modes" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SDCLKSEL" description="SD2 Clock source select." begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SDCLKSYNC" description="Enable Synchronizer on SD clock" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SDDATASYNC" description="Enable Synchronizer on SD data" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
