ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_sdfm_regs.xml
	<register id="SDCDATA4" width="16" page="0" offset="0x94" instances="1" instaddr="2" internal="0" description="Comparator Filter Data Register (16b) for Ch4">
		<bitfield id="DATA16" description="Comparator Data output - 16b only" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="SDFLT4CMPH2" width="16" page="0" offset="0x96" instances="1" instaddr="2" internal="0" description="Second high level threhold  for CH4">
		<bitfield id="HLT2" description="Second High level threshold." begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDFLT4CMPHZ" width="16" page="0" offset="0x98" instances="1" instaddr="2" internal="0" description="High-level (Z) Threshold Register for Ch4">
		<bitfield id="HLTZ" description="High-level threshold (Z) for the comparator filter output" begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDFIFOCTL4" width="16" page="0" offset="0x9a" instances="1" instaddr="2" internal="0" description="FIFO Control Register for Ch4">
		<bitfield id="SDFFIL" description="SDFIFO Interrupt Level" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SDFFST" description="SDFIFO Status" begin="10" end="6" width="5" rwaccess="R"/>
		<bitfield id="FFIEN" description="SDFIFO data ready Interrupt Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FFEN" description="SDFIFO Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="DRINTSEL" description="Data-Ready Interrupt Source Select" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="OVFIEN" description="SDFIFO Overflow interrupt enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDSYNC4" width="16" page="0" offset="0x9c" instances="1" instaddr="2" internal="0" description="SD Filter Sync control for Ch4">
		<bitfield id="SYNCSEL" description="SDSYNC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="WTSYNCEN" description="Wait-for-Sync Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="WTSYNFLG" description="Wait-for-Sync Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="WTSYNCLR" description="Wait-for-Sync Flag Clear " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="FFSYNCCLREN" description="FIFO Clear-on-SDSYNC Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="WTSCLREN" description="WTSYNFLG Clear-on-FIFOINT Enable" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="SDFLT4CMPL2" width="16" page="0" offset="0x9e" instances="1" instaddr="2" internal="0" description="Second low level threhold  for CH4">
		<bitfield id="LLT2" description="Second low-level threshold for the comparator filter output." begin="14" end="0" width="15" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1CTL" width="16" page="0" offset="0xc0" instances="1" instaddr="2" internal="0" description="SD Comparator event filter1 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1EVT2FLTCTL" width="16" page="0" offset="0xc2" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter1 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1EVT2FLTCLKCTL" width="16" page="0" offset="0xc4" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter1 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1EVT1FLTCTL" width="16" page="0" offset="0xc6" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter1 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1EVT1FLTCLKCTL" width="16" page="0" offset="0xc8" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter1 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP1LOCK" width="16" page="0" offset="0xce" instances="1" instaddr="2" internal="0" description="SD  compartor event filter1 Lock Register">
		<bitfield id="SDCOMP1CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2CTL" width="16" page="0" offset="0xd0" instances="1" instaddr="2" internal="0" description="SD Comparator event filter2 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2EVT2FLTCTL" width="16" page="0" offset="0xd2" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter2 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2EVT2FLTCLKCTL" width="16" page="0" offset="0xd4" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter2 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2EVT1FLTCTL" width="16" page="0" offset="0xd6" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter2 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP2EVT1FLTCLKCTL" width="16" page="0" offset="0xd8" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter2 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
