ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_sdfm_regs.xml
	<register id="SDCOMP2LOCK" width="16" page="0" offset="0xde" instances="1" instaddr="2" internal="0" description="SD  compartor event filter2 Lock Register">
		<bitfield id="SDCOMP2CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3CTL" width="16" page="0" offset="0xe0" instances="1" instaddr="2" internal="0" description="SD Comparator event filter3 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT2FLTCTL" width="16" page="0" offset="0xe2" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter3 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT2FLTCLKCTL" width="16" page="0" offset="0xe4" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter3 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT1FLTCTL" width="16" page="0" offset="0xe6" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter3 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3EVT1FLTCLKCTL" width="16" page="0" offset="0xe8" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter3 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP3LOCK" width="16" page="0" offset="0xee" instances="1" instaddr="2" internal="0" description="SD  compartor event filter3 Lock Register">
		<bitfield id="SDCOMP3CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4CTL" width="16" page="0" offset="0xf0" instances="1" instaddr="2" internal="0" description="SD Comparator event filter4 Control Register">
		<bitfield id="CEVT1DIGFILTSEL" description="High Comparator Trip Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CEVT2DIGFILTSEL" description="Low Comparator Trip Select" begin="11" end="10" width="2" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT2FLTCTL" width="16" page="0" offset="0xf2" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter4 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT2FLTCLKCTL" width="16" page="0" offset="0xf4" instances="1" instaddr="2" internal="0" description="COMPL/CEVT2 Digital filter4 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT1FLTCTL" width="16" page="0" offset="0xf6" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter4 Control Register">
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="4" width="5" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="13" end="9" width="5" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4EVT1FLTCLKCTL" width="16" page="0" offset="0xf8" instances="1" instaddr="2" internal="0" description="COMPH/CEVT1 Digital filter4 Clock Control Register">
		<bitfield id="CLKPRESCALE" description="Sample Clock Prescale" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="SDCOMP4LOCK" width="16" page="0" offset="0xfe" instances="1" instaddr="2" internal="0" description="SD  compartor event filter4 Lock Register">
		<bitfield id="SDCOMP4CTL" description="COMPCTL Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COMP" description="COMPevent filter registers Lock" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
</module>
